//Написать программу, которая через prompt считывает число и выводит в консоль число равное 10% от введенного числа

// let num1 = prompt("Введите число:");
// let num2 = Number(num1) *0.1;
// console.log(num2);

// Написать программу, которая получает два числа и выводит наименьшее

// let num1 = +prompt("Введите первое число");
// let num2 = +prompt("Введите второе число");

// if (num1 > num2){
//     console.log(num2);
// }
//  else if(num1 < num2){
//     console.log(num1)
//  }
// else{
//     console.log(`${num1} = ${num2}`);
// }

//Написать программу, которая считывает через prompt число и выводит одно из следующих сообщений: ‘Число меньше 100’, ‘Число больше 100’ или ‘Число равно 100’

// let num1 = +prompt("Введите первое число");

// if (num1 < 100){
//     console.log("Число меньше 100");
//  }
//  else if(num1 > 100){
//     console.log("Число больше 100")
//   }
//  else{
//     console.log("num1 = 100");
//  }

// Написать программу, которая запрашивает у пользователя его имя и возраст (в годах) и выводит в консоль сообщение ‘Hello, <name>’, если пользователь совершеннолетний, или ‘Hi, <name>’, если пользователь несовершеннолетний.

// let Name = prompt("Введите ваше имя:");
// let Age = prompt("Введите ваш возраст:");
//     if (Age >= 18){
//         console.log('Hello, Name');
//     }
//     else{
//         console.log(`Hi ${Name}`);
//     }
